tap "joaodrp/tap"
tap "mike-engel/jwt-cli"
tap "shopify/shopify"
# Download with resuming and segmented downloading
brew "aria2"
# Record and share terminal sessions
brew "asciinema"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"
# Official Amazon AWS command-line interface
brew "awscli"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Statistics utility to count lines of code
brew "cloc"
# Cross-platform make
brew "cmake"
# Color-highlighted diff(1) output
brew "colordiff"
# Tool for interacting with remote images and registries
brew "crane"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Utility to replace problematic characters in filenames
brew "detox"
# Good-lookin' diffs with diff-highlight and more
brew "diff-so-fancy"
# Load/unload environment variables based on $PWD
brew "direnv"
# Tool for exploring each layer in a docker image
brew "dive"
# Isolated development environments using Docker
brew "docker-compose"
# Text processing system for reStructuredText
brew "docutils"
# GNU version of the tar archiving utility
brew "gnu-tar"
# Modern replacement for 'ls'
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Collection of GNU find, xargs, and locate
brew "findutils"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# CLI program that accepts piped input and presents files for selection
brew "fpp"
# Command-line fuzzy finder written in Go
brew "fzf"
# Distributed revision control system
brew "git"
# Enable transparent encryption/decryption of files in a git repo
brew "git-crypt"
# Git extension for versioning large files
brew "git-lfs"
# Render markdown on the CLI
brew "glow"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU implementation of time utility
brew "gnu-time"
# Passphrase entry dialog utilizing the Assuan protocol
brew "pinentry"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Command-driven, interactive function plotting
brew "gnuplot"
# Go implementation of configuration language for defining JSON data
brew "go-jsonnet"
# Fast linters runner for Go
brew "golangci-lint"
# Ping, but with a graph
brew "gping"
# Image processing tools collection
brew "graphicsmagick"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Colorize logfiles and command output
brew "grc"
# GNU grep, egrep and fgrep
brew "grep"
# Kubernetes package manager
brew "helm"
# Command-line tools for OpenPGP-related operations
brew "hopenpgp-tools"
# Improved top (interactive process viewer)
brew "htop"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Curl statistics made simple
brew "httpstat"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Package manager for Jsonnet
brew "jsonnet-bundler"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "k9s"
# Conversion library
brew "libiconv"
# Postgres C API library
brew "libpq"
# Mac App Store command-line interface
brew "mas"
# Run a Kubernetes cluster locally
brew "minikube"
# High Performance, Kubernetes Native Object Storage
brew "minio"
# Intercept, modify, replay, save HTTP/S traffic
brew "mitmproxy"
# NCurses Disk Usage
brew "ncdu"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# HTTP(S) server and reverse proxy, and IMAP/POP3 proxy server
brew "nginx", restart_service: true
# PostgreSQL syntax beautifier
brew "pgformatter"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Tool for managing OCI containers and pods
brew "podman"
# Object-relational database system
brew "postgresql", restart_service: true
# Show ps output as a tree
brew "pstree"
# Rsync for cloud storage
brew "rclone"
# Alternative to backtracking PCRE-style regular expression engines
brew "re2"
# Persistent key-value database, with built-in net interface
brew "redis", restart_service: true
# Perl-powered file rename script with many helpful built-ins
brew "rename"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Collection of tools for managing UNIX services
brew "runit"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Work with remote images registries
brew "skopeo"
# Terminal based presentation tool
brew "slides"
# Add a public key to a remote machine's authorized_keys file
brew "ssh-copy-id"
# Statistics from the command-line
brew "st"
# Tail multiple Kubernetes pods & their containers
brew "stern"
# Version control system designed to be a better CVS
brew "subversion"
# Modern SSH server for teams managing distributed infrastructure
brew "teleport"
# User interface to the TELNET protocol
brew "telnet"
# Send macOS User Notifications from the command-line
brew "terminal-notifier"
# Code-search similar to ack
brew "the_silver_searcher"
# Text interface for Git repositories
brew "tig"
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
# Manage complex tmux sessions easily
brew "tmuxinator"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# HTTP load testing tool and library
brew "vegeta"
# Vi 'workalike' with many additional features
brew "vim"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# Linter for YAML files
brew "yamllint"
# JavaScript package manager
brew "yarn"
# Tool for managing your YubiKey configuration
brew "ykman"
# YubiKey personalization library and tool
brew "ykpers"
# Tracks most-used directories to make cd smarter
brew "z"
# General-purpose lossless data-compression library
brew "zlib"
# Super fast CLI tool to decode and encode JWTs built in Rust
brew "mike-engel/jwt-cli/jwt-cli"
brew "shopify/shopify/toxiproxy"
# Command-line helper for the 1Password password manager
cask "1password-cli"
# Terminal emulator with native dark mode support
cask "ghostty"
# Enable Windows-like alt-tab
cask "alt-tab"
# Records audio from any application
cask "audio-hijack"
# Virtual Audio Driver
cask "blackhole-2ch"
# Automated testing of webapps for Google Chrome
cask "chromedriver"
# API documentation browser and code snippet manager
cask "dash"
# Web browser
cask "firefox"
# Screen color temperature controller
cask "flux"
# Download manager with a torrent client
cask "folx"
cask "font-inconsolata"
cask "font-inconsolata-for-powerline"
# Typeface made for developers
cask "font-jetbrains-mono"
cask "font-source-code-pro"
# Displays all your GitLab activities in one place
cask "gitdock"
# Go (golang) IDE
cask "goland"
# Web browser
cask "google-chrome"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "google-cloud-sdk"
# Utility to fix grammar errors and style issues in text
cask "grammarly"
# HTTP and GraphQL Client
cask "insomnia"
# Control the volume of Apple Music and Spotify using keyboard volume keys
cask "itunes-volume-control"
# File archiver
cask "keka"
# Host-based application firewall
cask "little-snitch"
# Clipboard manager
cask "maccy"
# Tool to create text-based art
cask "monodraw"
# Orchestrates virtual Ubuntu instances
cask "multipass"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# Calculator and converter application
cask "numi"
# Open-source software for live streaming and screen recording
cask "obs"
# Verify system files structure, run miscellaneous maintenance and more
cask "onyx"
# Desktop virtualization software
cask "parallels"
# Control your tools with a few keystrokes
cask "raycast"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Ruby on Rails IDE
cask "rubymine"
# Store SSH keys in the Secure Enclave
cask "secretive"
# Team communication and collaboration software
cask "slack"
# Sound and audio controller
cask "soundsource"
# Configurable document editor that supports Markdown
cask "typora"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Video communication and virtual meeting platform
cask "zoom"
