tap "anomalyco/tap"
tap "cormacrelf/tap"
tap "joaodrp/tap"
tap "mike-engel/jwt-cli"
tap "oven-sh/bun"
tap "shopify/shopify"
# Automate deployment, configuration, and upgrading
brew "ansible"
# Record and share terminal sessions
brew "asciinema"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Official Amazon AWS command-line interface
brew "awscli"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Incredibly fast JavaScript runtime, bundler, transpiler, and package manager
brew "oven-sh/bun/bun"
# Statistics utility to count lines of code
brew "cloc"
# Cross-platform make
brew "cmake"
# Container signing, verification, and storage in an OCI registry
brew "cosign"
# Tool for interacting with remote images and registries
brew "crane"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Watcher for macOS dark/light mode changes
brew "cormacrelf/tap/dark-notify"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Load/unload environment variables based on $PWD
brew "direnv"
# Visually compare two PDF files
brew "diff-pdf"
# Tool for exploring each layer in a docker image
brew "dive"
# Isolated development environments using Docker
brew "docker-compose"
# Text processing system for reStructuredText
brew "docutils"
# Utilities for the ext2, ext3, and ext4 file systems
brew "e2fsprogs"
# Modern replacement for 'ls'
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Collection of GNU find, xargs, and locate
brew "findutils"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Command-line fuzzy finder written in Go
brew "fzf"
# AI agent from Google in the terminal
brew "gemini-cli"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# GitLab command-line tool
brew "glab"
# Enable transparent encryption/decryption of files in a git repo
brew "git-crypt"
# Git extension for versioning large files
brew "git-lfs"
# Scan git repos for secrets
brew "gitleaks"
# Render markdown on the CLI
brew "glow"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU implementation of time utility
brew "gnu-time"
# GNU version of the tar archiving utility
brew "gnu-tar"
# Passphrase entry dialog utilizing the Assuan protocol
brew "pinentry"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Command-driven, interactive function plotting
brew "gnuplot"
# Fast linters runner for Go
brew "golangci-lint"
# Release automation tool for Go projects
brew "goreleaser"
# Ping, but with a graph
brew "gping"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Colorize logfiles and command output
brew "grc"
# GNU grep, egrep and fgrep
brew "grep"
# Kubernetes package manager
brew "helm"
# Improved top (interactive process viewer)
brew "htop"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Curl statistics made simple
brew "httpstat"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Handy way to save and run project-specific commands
brew "just"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "k9s"
# Conversion library
brew "libiconv"
# Postgres C API library
brew "libpq"
# Mac App Store command-line interface
brew "mas"
# Run a Kubernetes cluster locally
brew "minikube"
# Polyglot runtime manager (asdf rust clone)
brew "mise"
# Remote terminal application
brew "mosh"
# NCurses Disk Usage
brew "ncdu"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Port scanning utility for large networks
brew "nmap"
# Platform built on V8 to build network applications
brew "node"
# OCI Registry As Storage
brew "oras"
# PostgreSQL syntax beautifier
brew "pgformatter"
# PGP packet visualizer
brew "pgpdump"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Show ps output as a tree
brew "pstree"
# Draw UML diagrams from text descriptions
brew "plantuml"
# Pre-commit re-implemented in Rust
brew "prek"
# Tools for and transforming and inspecting PDF files
brew "qpdf"
# Rsync for cloud storage
brew "rclone"
# Alternative to backtracking PCRE-style regular expression engines
brew "re2"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Work with remote images registries
brew "skopeo"
# Terminal based presentation tool
brew "slides"
# Add a public key to a remote machine's authorized_keys file
brew "ssh-copy-id"
# Tail multiple Kubernetes pods & their containers
brew "stern"
# Modern SSH server for teams managing distributed infrastructure
brew "teleport"
# User interface to the TELNET protocol
brew "telnet"
# Send macOS User Notifications from the command-line
brew "terminal-notifier"
# Text interface for Git repositories
brew "tig"
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
# Manage complex tmux sessions easily
brew "tmuxinator"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Extremely fast Python package installer and resolver
brew "uv"
# HTTP load testing tool and library
brew "vegeta"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Watch files and take action when they change
brew "watchman"
# Internet file retriever
brew "wget"
# Linter for YAML files
brew "yamllint"
# Tool for managing your YubiKey configuration
brew "ykman"
# YubiKey personalization library and tool
brew "ykpers"
# General-purpose lossless data-compression library
brew "zlib"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# AI-powered coding assistant
brew "anomalyco/tap/opencode"
# Super fast CLI tool to decode and encode JWTs built in Rust
brew "mike-engel/jwt-cli/jwt-cli"
# Proxy for simulating network conditions
brew "shopify/shopify/toxiproxy"
# Password manager
cask "1password"
# Command-line helper for the 1Password password manager
cask "1password-cli"
# Application uninstaller
cask "appcleaner"
# Battery management app
cask "batfi"
# Anthropic's Claude desktop app
cask "claude"
# Screenshot and screen recording tool
cask "cleanshot"
# AI coding assistant CLI
cask "claude-code"
# AI coding agent from OpenAI
cask "codex"
# AI code review CLI
cask "coderabbit"
# App to build and share containerised applications and microservices
cask "docker-desktop"
# Web browser
cask "firefox"
# Slender monospace typeface
cask "font-iosevka"
# Typeface made for developers
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
# Monospaced font family from GitHub
cask "font-monaspace"
# Programming font with rounded corners
cask "font-mononoki"
# Terminal emulator with native dark mode support
cask "ghostty"
# Web browser
cask "google-chrome"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "gcloud-cli"
# File archiver
cask "keka"
# Host-based application firewall
cask "little-snitch"
# Show upcoming meetings in menu bar
cask "meetingbar"
# Intercept, modify, replay, save HTTP/S traffic
cask "mitmproxy"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# AI-powered coding assistant desktop app
cask "opencode-desktop"
# Control your tools with a few keystrokes
cask "raycast"
# Internet radio player
cask "radiola"
# GUI for Redis databases
cask "redis-insight"
# Store SSH keys in the Secure Enclave
cask "secretive"
# Team communication and collaboration software
cask "slack"
# Teleport shell client
cask "tsh"
# Open-source code editor
cask "visual-studio-code"
# Multiplayer code editor
cask "zed"
# Multimedia player
cask "vlc"
# Messaging app
cask "whatsapp"
# Hardware security key authenticator
cask "yubico-authenticator"
# Video communication and virtual meeting platform
cask "zoom"
# 1Password Safari extension
mas "1Password for Safari", id: 1569813296
# Kagi search Safari extension
mas "Kagi for Safari", id: 1622835804
# Save to Readwise Reader
mas "Save to Reader", id: 1640236961
# Task manager
mas "Things", id: 904280696
# Apple IDE
mas "Xcode", id: 497799835
